build/docs/webservices/webservices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Webservices for page transformation</title>
<!-- 2017-08-15 Tue 17:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../style/css/override.css" />
<link rel="icon" type="image/png" href="../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Webservices for page transformation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Requirements</a></li>
<li><a href="#sec-2">2. List of APIs used</a></li>
<li><a href="#sec-3">3. Imports</a>
<ul>
<li><a href="#sec-3-1">3.1. Imports for Python API</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Api's</a>
<ul>
<li><a href="#sec-4-1">4.1. Introduction</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. List of APIs</a></li>
<li><a href="#sec-4-1-2">4.1.2. phonetic API introduction</a></li>
<li><a href="#sec-4-1-3">4.1.3. language translation API</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. setting list and keys</a></li>
<li><a href="#sec-4-3">4.3. phonetic-trans API</a></li>
<li><a href="#sec-4-4">4.4. language-trans</a></li>
<li><a href="#sec-4-5">4.5. currency-conversion</a></li>
<li><a href="#sec-4-6">4.6. measurement-conversion</a></li>
<li><a href="#sec-4-7">4.7. test api</a></li>
</ul>
</li>
<li><a href="#sec-5">5. run</a>
<ul>
<li><a href="#sec-5-1">5.1. running the app</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Dependencies</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Requirements</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Requirement is to build web-services for providing user friendly renarrations.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> List of APIs used</h2>
<div class="outline-text-2" id="text-2">
<p>
Following are the list of APIs used for the release.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">API usage</th>
<th scope="col" class="left">URL</th>
<th scope="col" class="left">header</th>
<th scope="col" class="left">payload</th>
<th scope="col" class="left">result</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">required</th>
<th scope="col" class="left">required</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Phonetic Translation</td>
<td class="left">/phonetic-trans</td>
<td class="left">'Content-type':</td>
<td class="left">'sentence':</td>
<td class="left">returns phonetic</td>
</tr>

<tr>
<td class="left">of sentence</td>
<td class="left">&#xa0;</td>
<td class="left">'application/json'</td>
<td class="left">required sentence</td>
<td class="left">translation of</td>
</tr>

<tr>
<td class="left">from list</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">words in the sentence</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">from the list.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Language translation</td>
<td class="left">/language-translive</td>
<td class="left">'Content-type':</td>
<td class="left">'sentence':</td>
<td class="left">returns the language</td>
</tr>

<tr>
<td class="left">from web</td>
<td class="left">&#xa0;</td>
<td class="left">'application/json'</td>
<td class="left">required sentence</td>
<td class="left">translation of the</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">sentence</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Imports</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Imports for Python API</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Following imports are used for running the webservices on flask
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">from</span> flask <span style="font-weight: bold;">import</span> Flask
<span style="font-weight: bold;">from</span> flask <span style="font-weight: bold;">import</span> request
<span style="font-weight: bold;">import</span> requests <span style="font-weight: bold;">as</span> req
<span style="font-weight: bold;">import</span> bs4
<span style="font-weight: bold;">import</span> pickle
<span style="font-weight: bold;">from</span> flask_cors <span style="font-weight: bold;">import</span> CORS

<span style="font-weight: bold; font-style: italic;">app</span> = Flask(<span style="font-weight: bold;">__name__</span>)
CORS(app)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Api's</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Introduction</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> List of APIs</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Following are the list of the APIs used
</p>
<ul class="org-ul">
<li>phonetic-trans
</li>
<li>language-translive
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> phonetic API introduction</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
We use pickle library for fast loading of the dictionary whenever the
server starts for the first time.  The dictionary for the phonetic
translation is stored in file word.p from which the dictionary is
loaded in the beginning when server is started.
</p>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> language translation API</h4>
<div class="outline-text-4" id="text-4-1-3">
<ul class="org-ul">
<li>For language translation, API of <a href="https://tech.yandex.com">https://tech.yandex.com</a> is used. 
</li>
<li>The website provides a free key for making max of 350 requests per day.
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> setting list and keys</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Phonetic translation of all the 1000 basic words is stored in
word_list.p which is loaded
</li>
<li>The translation key for using language translation is loaded here.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">word_list</span> = pickle.load( <span style="font-weight: bold;">open</span>( <span style="font-style: italic;">"word_list.p"</span>, <span style="font-style: italic;">"rb"</span> ) )
<span style="font-weight: bold; font-style: italic;">translatekey</span> = <span style="font-style: italic;">'trnsl.1.1.20160620T044235Z.009e3fdaf079e045.51ec20ede6d14038c2cb193de1f8891c28dfc749'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> phonetic-trans API</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Following is the code for getting the phonetic translation from the list
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@app.route</span>(<span style="font-style: italic;">"/phonetic-trans"</span>, methods=[<span style="font-style: italic;">'POST'</span>])
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">phonetictrans</span>():
    <span style="font-weight: bold; font-style: italic;">sentence</span> = request.json[<span style="font-style: italic;">'sentence'</span>]
    <span style="font-weight: bold; font-style: italic;">words</span> = sentence.split()
    <span style="font-weight: bold; font-style: italic;">answer</span> = []
    <span style="font-weight: bold;">for</span> word <span style="font-weight: bold;">in</span> words :
        <span style="font-weight: bold; font-style: italic;">word</span> = word.lower()
        <span style="font-weight: bold;">if</span> word <span style="font-weight: bold;">in</span> word_list:
            answer.append(word_list[word])
        <span style="font-weight: bold;">else</span> :
            answer.append(word)
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">" "</span>.join(answer)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> language-trans</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Following is the code for getting the language translation from the web
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@app.route</span>(<span style="font-style: italic;">"/language-translive"</span>, methods=[<span style="font-style: italic;">'POST'</span>])
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">languagetranslive</span>():
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold; font-style: italic;">sentence</span> = request.json[<span style="font-style: italic;">'sentence'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"sentence parameter not passed"</span>
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">fromlang</span> = request.json[<span style="font-style: italic;">'from-language'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"en"</span>
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">tolang</span> = request.json[<span style="font-style: italic;">'to-language'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"to language not passed"</span>

    <span style="font-weight: bold; font-style: italic;">res</span> = req.get(<span style="font-style: italic;">'https://translate.yandex.net/api/v1.5/tr/translate?key='</span>+translatekey+<span style="font-style: italic;">'&amp;text='</span>+sentence+<span style="font-style: italic;">'&amp;lang='</span>+fromlang+<span style="font-style: italic;">'-'</span>+tolang+<span style="font-style: italic;">'&amp;format=plain&amp;options=0'</span>);
    <span style="font-weight: bold; font-style: italic;">soup</span> = bs4.BeautifulSoup(res.text)
    <span style="font-weight: bold; font-style: italic;">ret</span> = soup.text
    <span style="font-weight: bold;">return</span> ret;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> currency-conversion</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Following is the code for getting the currency conversion from the web
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@app.route</span>(<span style="font-style: italic;">"/currency-conversion"</span>, methods=[<span style="font-style: italic;">'POST'</span>])
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">currencyconversion</span>():
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">cur_amount</span> = request.json[<span style="font-style: italic;">'cur_amount'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"cur_amount parameter is not passed"</span>
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold; font-style: italic;">from_cur</span> = request.json[<span style="font-style: italic;">'from_cur'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"from_cur parameter is not passed"</span>
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">to_cur</span> = request.json[<span style="font-style: italic;">'to_cur'</span>]
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"to_cur parameter is not passed"</span>

    <span style="font-weight: bold;">if</span> (from_cur == <span style="font-style: italic;">"USD"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"INR"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*64.78
    <span style="font-weight: bold;">elif</span> (from_cur == <span style="font-style: italic;">"USD"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"EUR"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*0.88
    <span style="font-weight: bold;">elif</span> (from_cur == <span style="font-style: italic;">"INR"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"USD"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*0.015
    <span style="font-weight: bold;">elif</span> (from_cur == <span style="font-style: italic;">"INR"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"EUR"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*0.014
    <span style="font-weight: bold;">elif</span> (from_cur == <span style="font-style: italic;">"EUR"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"USD"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*1.13
    <span style="font-weight: bold;">elif</span> (from_cur == <span style="font-style: italic;">"EUR"</span> <span style="font-weight: bold;">and</span> to_cur == <span style="font-style: italic;">"INR"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount*73.34
    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold; font-style: italic;">res</span> = cur_amount
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">str</span>(res)+<span style="font-style: italic;">" "</span>+to_cur
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> measurement-conversion</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Following is the code for getting the measurement-conversion.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@app.route</span>(<span style="font-style: italic;">"/measurement-conversion"</span>, methods=[<span style="font-style: italic;">'POST'</span>])
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">measurementconversion</span>():
    <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"inside fsdfds"</span>
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">measurement_num</span> = request.json[<span style="font-style: italic;">'measurement_num'</span>]
        <span style="font-weight: bold;">print</span> measurement_num
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"to_measure parameter is not passed"</span>
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold; font-style: italic;">from_measure</span> = request.json[<span style="font-style: italic;">'from_measure'</span>]
        <span style="font-weight: bold;">print</span> from_measure
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"from_measure parameter is not passed"</span>
    <span style="font-weight: bold;">try</span> :
        <span style="font-weight: bold; font-style: italic;">to_measure</span> = request.json[<span style="font-style: italic;">'to_measure'</span>]
        <span style="font-weight: bold;">print</span> to_measure
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"to_measure parameter is not passed"</span>

    <span style="font-weight: bold;">if</span> (from_measure == <span style="font-style: italic;">"km"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"mi"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num*0.62137
    <span style="font-weight: bold;">elif</span> (from_measure == <span style="font-style: italic;">"km"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"ft"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num*3280.8
    <span style="font-weight: bold;">elif</span> (from_measure == <span style="font-style: italic;">"mi"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"km"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num/0.62137
    <span style="font-weight: bold;">elif</span> (from_measure == <span style="font-style: italic;">"mi"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"ft"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num * 5280.0
    <span style="font-weight: bold;">elif</span> (from_measure == <span style="font-style: italic;">"ft"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"km"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num * 0.0003048
    <span style="font-weight: bold;">elif</span> (from_measure == <span style="font-style: italic;">"ft"</span> <span style="font-weight: bold;">and</span> to_measure == <span style="font-style: italic;">"mi"</span>):
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num * 0.00018939
    <span style="font-weight: bold;">else</span>:
        <span style="font-weight: bold; font-style: italic;">res</span> = measurement_num
    <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">str</span>(res)+<span style="font-style: italic;">" "</span>+to_measure
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> test api</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold; text-decoration: underline;">@app.route</span>(<span style="font-style: italic;">"/test"</span>, methods=[<span style="font-style: italic;">'GET'</span>])
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">test</span>():
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"some test string"</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> run</h2>
<div class="outline-text-2" id="text-5">
<p>
Running the app
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> running the app</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">if</span> <span style="font-weight: bold;">__name__</span> == <span style="font-style: italic;">'__main__'</span>:
   app.run()
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Dependencies</h2>
<div class="outline-text-2" id="text-6">
<p>
The depedencies of the webservices and virtual enviornment setup can
be done by the following bash commands.
</p>

<div class="org-src-container">

<pre class="src src-bash">#! bash script for setting up enviornment for webservices

sudo apt-get install python-virtualenv

virtualenv flask

flask/bin/pip install flask

flask/bin/pip install requests

flask/bin/pip install bs4

flask/bin/pip install -U flask-cors
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2016-06-17 Fri]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-15 Tue 17:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
